In [32]:
from pandas import DataFrame, Series
import pandas as pd

In [2]:
s = Series(range(1,5))

In [4]:
s.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
data = {"name": ['Jason','Molly','Tina','순이','영이'],
       "age":[20,30,40,50,60],
       "reports": [4,34,56,12,23]}

In [14]:
df = DataFrame(data, index=['서울','부사','광주','대구','대구'])

In [16]:
df.index

Index(['서울', '부사', '광주', '대구', '대구'], dtype='object')

In [17]:
df.columns

Index(['age', 'name', 'reports'], dtype='object')

In [20]:
idx =df.index

In [24]:
idx.tolist

In [25]:
s1 = Series(range(1,6))

In [27]:
s2 = s1 * s1

In [30]:
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [37]:
s2.index = s2.index + 2

In [38]:
df = pd.concat([s1, s2], axis=1)

In [39]:
df

     0     1
0  1.0   NaN
1  2.0   NaN
2  3.0   1.0
3  4.0   4.0
4  5.0   9.0
5  NaN  16.0
6  NaN  25.0

In [44]:
s3 = Series({"Tome": 1, "Dick": 2, "Jane": 3})

In [45]:
s4 = Series({"Tome":9, "Dick": 8, "Jan": 7})

In [47]:
df = pd.concat({'A':s3, 'B':s4}, axis=1)

In [49]:
df.to_dict()

{'A': {'Dick': 2.0, 'Jan': nan, 'Jane': 3.0, 'Tome': 1.0},
 'B': {'Dick': 8.0, 'Jan': 7.0, 'Jane': nan, 'Tome': 9.0}}

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Dick to Tome
Data columns (total 2 columns):
A    3 non-null float64
B    3 non-null float64
dtypes: float64(2)
memory usage: 96.0+ bytes

In [51]:
df.describe()

         A    B
count  3.0  3.0
mean   2.0  8.0
std    1.0  1.0
min    1.0  7.0
25%    1.5  7.5
50%    2.0  8.0
75%    2.5  8.5
max    3.0  9.0

In [52]:
df

        A    B
Dick  2.0  8.0
Jan   NaN  7.0
Jane  3.0  NaN
Tome  1.0  9.0

In [53]:
df.T

   Dick  Jan  Jane  Tome
A   2.0  NaN   3.0   1.0
B   8.0  7.0   NaN   9.0

In [54]:
df.axes

[Index(['Dick', 'Jan', 'Jane', 'Tome'], dtype='object'),
 Index(['A', 'B'], dtype='object')]

In [55]:
r,c = df.axes

In [56]:
r

Index(['Dick', 'Jan', 'Jane', 'Tome'], dtype='object')

In [57]:
c

Index(['A', 'B'], dtype='object')

In [58]:
df.dtypes

A    float64
B    float64
dtype: object

In [59]:
df.empty

False

In [60]:
df.ndim

2

In [61]:
df.shape

(4, 2)

In [62]:
df.size

8

In [63]:
df.values

array([[ 2.,  8.],
       [nan,  7.],
       [ 3., nan],
       [ 1.,  9.]])

In [74]:
for name, series in df.iteritems():
    print(name)
    print(series)

A
Dick    2.0
Jan     NaN
Jane    3.0
Tome    1.0
Name: A, dtype: float64
B
Dick    8.0
Jan     7.0
Jane    NaN
Tome    9.0
Name: B, dtype: float64

In [85]:
df.columns.tolist()

['A', 'B']

In [87]:
for index, row in df.iterrows():
    print(row)

A    2.0
B    8.0
Name: Dick, dtype: float64
A    NaN
B    7.0
Name: Jan, dtype: float64
A    3.0
B    NaN
Name: Jane, dtype: float64
A    1.0
B    9.0
Name: Tome, dtype: float64

In [88]:
df

        A    B
Dick  2.0  8.0
Jan   NaN  7.0
Jane  3.0  NaN
Tome  1.0  9.0

In [89]:
df2 = df.copy()

In [90]:
all(df.index == df2.index)

True